
First we define what we mean by single characters in our own format
(char space+ definition newline). Do this in a code space.

then we define our keymaps in a nice grid using combinations of
those single characters seperated by whitespace.

Next we define our keyboard as a sequence of columns and rows
or just all of the keys and define how they relate to the grid
we used in our keymaps.

Finally we write the firmware that runs on the keyboard. It should be
specific to our keyboard. We are doing this "inside-out" as compared
to most software these days -- We are writing the firmware ourselves
using help from utility routines to make the code idiomatic. This is
contrasted with the more common approach of providing a framework or
library that you use by way of configuration.

* Generate KMK firmware keymap list

#+name: generate_kmk_keymap
#+begin_src python :var src=planck_20221020 :var conversion_in=conversion :results value
import json
json.dump(src.split('\n\n'), open('output/layers.json', 'w'))

def chunk(iterable, n):
    args = [iter(iterable)] * n
    return zip(*args)

import re, json
conversion = {}
for s in conversion_in.split('\n')[1:]:
    if s:
        k, *vals = re.findall(r'\S+', s)
        conversion[k] = vals[1]

### GUIDO TeX output        
### GUIDO TeX output        
escape = {
    '&': '\\&', '%': '\\%', '$': '\\$', '#': '\\#', '_': '\\_', '{': '$\\{$', '}': '$\\}$',
    '~': '\\char`\\~', '^': '\\char`\\^', '\\': 'poop',
    '⇥': 'TAB', '◌': '' # '\\bigcirc',
}
import string
def key(k):
    if k in string.ascii_lowercase:
        k = k.upper()
    return escape.get(k, k)
layer = lambda l: [key(k) for k in l.split()]

def weave(i, layer):
    s = []
    for row in chunk(layer, 12):
        s.append(' & '.join(row) + ' \\cr')
    return '\n'.join(s) + '\\cr'

tex = '\n'.join([weave(i, layer(l)) for i, l in enumerate(src.split('\n\n'))])
with open('output/pretty.tex', 'w') as f:
    f.write('\\tt \halign{\n')
    f.write('&'.join(['\\hfil\\quad#\\quad\\hfil']*12))
    f.write('\\cr\n')
    f.write(tex)
    f.write('}\n\\bye')
### GUIDO TeX output        
### GUIDO TeX output        

key = lambda k: f'D({conversion[k[1:]]})' if k[0] == '⍉' else conversion[k]
layer = lambda l: [key(k) for k in l.split()]

def tangle(i, layer):
    s = ['[', f'# Layer {i}']
    for row in chunk(layer, 12):
        s.append(', '.join(row) + ',')
    s.append('],')
    return '\n'.join(s)

return '\n'.join([tangle(i, layer(l)) for i, l in enumerate(src.split('\n\n'))])
#+end_src

#+RESULTS: generate_kmk_keymap
#+begin_example
[
# Layer 0
KC.TAB, KC.Q, KC.W, KC.E, KC.R, KC.T, KC.Y, KC.U, KC.I, KC.O, KC.P, KC.BSPC,
KC.LCTL, KC.A, KC.S, KC.D, KC.F, KC.G, KC.H, KC.J, KC.K, KC.L, COLON_SEMI, KC.ENT,
KC.LSFT, KC.Z, KC.X, KC.C, KC.V, KC.B, KC.N, KC.M, KC.COMMA, KC.DOT, KC.SLASH, KC.NO,
KC.NO, KC.NO, KC.LOPT, KC.LCMD, KC.MO(1), KC.MO(3), KC.SPC, KC.MO(2), KC.NO, KC.NO, KC.NO, KC.NO,
],
[
# Layer 1
KC.TILDE, KC.EXLM, KC.AT, KC.HASH, KC.DLR, KC.PERC, KC.CIRC, KC.N7, KC.N8, KC.N9, KC.NO, KC.NO,
KC.NO, KC.DQUO, KC.AMPR, KC.PAST, KC.UNDS, KC.NO, KC.PLUS, KC.N4, KC.N5, KC.N6, KC.QUOT, KC.PIPE,
KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.DOT, KC.N0, KC.N1, KC.N2, KC.N3, KC.SLASH, KC.NO,
KC.NO, KC.NO, KC.LOPT, KC.LCMD, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
],
[
# Layer 2
KC.GRV, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.BSPC,
KC.NO, KC.LBRC, KC.RBRC, KC.LPRN, KC.RPRN, KC.NO, KC.NO, KC.MINUS, KC.EQL, KC.NO, KC.NO, KC.BSLS,
KC.NO, KC.LABK, KC.RABK, KC.LCBR, KC.RCBR, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
KC.NO, KC.NO, KC.LOPT, KC.LCMD, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
],
[
# Layer 3
KC.ESC, KC.NO, KC.NO, KC.F3, KC.F4, KC.NO, KC.NO, KC.PGUP, KC.UP, KC.PGDN, KC.NO, KC.NO,
KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.LEFT, KC.DOWN, KC.RIGHT, KC.NO, KC.NO,
KC.NO, KC.LCMD(KC.Z), KC.LCMD(KC.X), KC.LCMD(KC.C), KC.LCMD(KC.V), KC.NO, KC.NO, KC.HOME, KC.NO, KC.END, KC.NO, KC.NO,
KC.NO, KC.NO, KC.LOPT, KC.LCMD, KC.MO(1), KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
],
[
# Layer 4
KC.NO, KC.F1, KC.F2, KC.F3, KC.F4, KC.F5, KC.F6, KC.F7, KC.F8, KC.F9, KC.F10, KC.NO,
KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
KC.NO, KC.NO, KC.LOPT, KC.LCMD, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
],
[
# Layer 5
KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
KC.NO, KC.NO, KC.LOPT, KC.LCMD, KC.MO(4), KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO, KC.NO,
],
#+end_example


